api/app/controllers/api/auth/registrations_controller.rb

      def create
        # user_detailsのチェックを実行
        check_req = check_user_details
        # 必須パラメータが不足している場合、エラーレスポンスを返す
        if check_req.is_a?(Array)
          return render json: { errors: { user_details: check_req.map { |k| "user_details.#{k} が存在しません" } } }, status: :unprocessable_entity
        end

        # トランザクションの開始
        ActiveRecord::Base.transaction do
          # DeviseTokenAuthのsuperメソッドを呼び出し、リソースを作成
          super do |resource|
            # user_details が存在すれば保存
            if resource.persisted? && user_details_params.present?
              detail = resource.build_user_detail(user_details_params)
              unless detail.save
---
INSERT INTO `users` (`uid`, `encrypted_password`, `name`, `email`, `role_id`, `user_detail_id`, `created_at`, `updated_at`) VALUES ('admin@nutfes.com', '$2a$12$YKLCmR61dBBf.xDIlb2jaO9hwD6iHcPythtw9hv0Y7SMYV9iuOJXa', 'admin', 'admin@nutfes.com', 1, 1, '2020-07-20 16:38:46.646292', '2020-07-20 16:38:46.646292')
UPDATE `users` SET `users`.`tokens` = '{\"NFxXLjIGoeiRPsnSzKozbA\":{\"token\":\"$2a$10$jOH4klFS3Hz.G310K1YINePhSgaITIhAWdsy4XoGfYdLCYxXLo2rK\",\"expiry\":1596472726}}', `users`.`updated_at` = '2020-07-20 16:38:46.720825' WHERE `users`.`id` = 1