api/app/controllers/api/v1/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
  def update
    @user = User.find(params[:id])